Tekla Open API Reference for Tekla Structures 2025
SurfaceObject.Polymesh Property
 Gets or sets the surface geometry brep.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public FacetedBrep Polymesh { get; set; }
Public Property Polymesh As FacetedBrep
	Get
	Set
Property Value
Type: FacetedBrep
 The polymesh.
See Also
Reference
SurfaceObject Class
Tekla.Structures.Model Namespace